RSN/src/Catalogs/ГруппыПрофилей/ГруппыПрофилей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПрофилей</name>
  <comment>новые права</comment>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>EnumRef.КонфигурацииИнформационныхБаз</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ПрофильИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/Catalogs/ПрофилиГруппДоступаИнформационныхБаз/ПрофилиГруппДоступаИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиГруппДоступаИнформационныхБаз</name>
  <owners>Catalog.ИнформационныеБазы</owners>
  <tabularSections>
    <name>ГруппыДоступа</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/Catalogs/ГруппыПрофилей/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
Функция ПолучитьМассивПрофилей(ИБ, МассивГрупп) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ГруппыПрофилейСостав.ПрофильИБ КАК ПрофильИБ
	               |ПОМЕСТИТЬ ТаблицаИмен
	               |ИЗ
	               |	Справочник.ГруппыПрофилей.Состав КАК ГруппыПрофилейСостав
	               |ГДЕ
	               |	ГруппыПрофилейСостав.Ссылка В(&МассивГрупп)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПрофилиГруппДоступаИнформационныхБазГруппыДоступа.Имя КАК Имя
	               |ИЗ
	               |	Справочник.ПрофилиГруппДоступаИнформационныхБаз.ГруппыДоступа КАК ПрофилиГруппДоступаИнформационныхБазГруппыДоступа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИмен КАК ТаблицаИмен
	               |		ПО ПрофилиГруппДоступаИнформационныхБазГруппыДоступа.Имя = ТаблицаИмен.ПрофильИБ
	               |ГДЕ
	               |	ПрофилиГруппДоступаИнформационныхБазГруппыДоступа.Ссылка.Владелец В(&ИБ)";
	Запрос.УстановитьПараметр("ИБ", ИБ );
	Запрос.УстановитьПараметр("МассивГрупп", МассивГрупп);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Имя");
КонецФункции

Функция ПолучитьГруппыПрофилейПоПрофилям(ИБ,МассивПрофилей) Экспорт    
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационныеБазы.Ссылка КАК ИБ,
	               |	ИнформационныеБазы.Конфигурация КАК Конфигурация
	               |ПОМЕСТИТЬ Конфигурации
	               |ИЗ
	               |	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	               |ГДЕ
	               |	ИнформационныеБазы.Ссылка В(&ИБ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыПрофилейСостав.Ссылка.Конфигурация КАК Конфигурация,
	               |	ГруппыПрофилейСостав.ПрофильИБ КАК ПрофильИБ,
	               |	ГруппыПрофилейСостав.Ссылка КАК ГруппаПрофилей
	               |ПОМЕСТИТЬ ГруппыПрофилей
	               |ИЗ
	               |	Справочник.ГруппыПрофилей.Состав КАК ГруппыПрофилейСостав
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ГруппыПрофилей.ГруппаПрофилей КАК ГруппаПрофилей,
	               |	ГруппыПрофилей.Конфигурация КАК Конфигурация
	               |ПОМЕСТИТЬ ГруппаКонфигурация
	               |ИЗ
	               |	ГруппыПрофилей КАК ГруппыПрофилей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыПрофилей.ГруппаПрофилей КАК ГруппаПрофилей,
	               |	СУММА(1) КАК Найдено
	               |ПОМЕСТИТЬ Совпало
	               |ИЗ
	               |	ГруппыПрофилей КАК ГруппыПрофилей
	               |ГДЕ
	               |	ГруппыПрофилей.ПрофильИБ В(&Профили)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГруппыПрофилей.ГруппаПрофилей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыПрофилей.ГруппаПрофилей КАК ГруппаПрофилей,
	               |	СУММА(1) КАК Было
	               |ПОМЕСТИТЬ Исходные
	               |ИЗ
	               |	ГруппыПрофилей КАК ГруппыПрофилей
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГруппыПрофилей.ГруппаПрофилей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Исходные.ГруппаПрофилей КАК ГруппаПрофилей,
	               |	Конфигурации.ИБ КАК ИБ
	               |ПОМЕСТИТЬ ИБГруппа
	               |ИЗ
	               |	Исходные КАК Исходные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Совпало КАК Совпало
	               |		ПО Исходные.Было = Совпало.Найдено
	               |			И Исходные.ГруппаПрофилей = Совпало.ГруппаПрофилей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ГруппаКонфигурация КАК ГруппаКонфигурация
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Конфигурации КАК Конфигурации
	               |			ПО ГруппаКонфигурация.Конфигурация = Конфигурации.Конфигурация
	               |		ПО Исходные.ГруппаПрофилей = ГруппаКонфигурация.ГруппаПрофилей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыПрофилей.ПрофильИБ КАК ПрофильИБ,
	               |	ГруппыПрофилей.ГруппаПрофилей КАК ГруппаПрофилей,
	               |	ГруппыПрофилей1.ГруппаПрофилей КАК ГруппаПрофилей1,
	               |	ГруппыПрофилей1.ПрофильИБ КАК ПрофильИБ1
	               |ПОМЕСТИТЬ ГруппаКГруппе
	               |ИЗ
	               |	ГруппыПрофилей КАК ГруппыПрофилей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ГруппыПрофилей КАК ГруппыПрофилей1
	               |		ПО ГруппыПрофилей.ПрофильИБ = ГруппыПрофилей1.ПрофильИБ
	               |			И (ГруппыПрофилей.ГруппаПрофилей = ГруппыПрофилей1.ГруппаПрофилей = ЛОЖЬ)
	               |ГДЕ
	               |	НЕ ГруппыПрофилей1.ГруппаПрофилей ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппаКГруппе.ГруппаПрофилей КАК ГруппаПрофилей,
	               |	ГруппаКГруппе.ГруппаПрофилей1 КАК ГруппаПрофилей1,
	               |	СУММА(1) КАК Колво
	               |ПОМЕСТИТЬ ГГКолво
	               |ИЗ
	               |	ГруппаКГруппе КАК ГруппаКГруппе
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГруппаКГруппе.ГруппаПрофилей,
	               |	ГруппаКГруппе.ГруппаПрофилей1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГГКолво.ГруппаПрофилей КАК Папа,
	               |	ГГКолво.ГруппаПрофилей1 КАК Малыш
	               |ПОМЕСТИТЬ СвязиГрупп
	               |ИЗ
	               |	ГГКолво КАК ГГКолво
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Исходные КАК Исходные
	               |		ПО ГГКолво.ГруппаПрофилей1 = Исходные.ГруппаПрофилей
	               |ГДЕ
	               |	Исходные.Было = ГГКолво.Колво
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИБГруппа.ИБ КАК ИБ,
	               |	ИБГруппа.ГруппаПрофилей КАК Папа,
	               |	ИБГруппа1.ГруппаПрофилей КАК Малыш
	               |ПОМЕСТИТЬ ВсеСвязи
	               |ИЗ
	               |	ИБГруппа КАК ИБГруппа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИБГруппа КАК ИБГруппа1
	               |		ПО ИБГруппа.ИБ = ИБГруппа1.ИБ
	               |ГДЕ
	               |	ИБГруппа.ГруппаПрофилей = ИБГруппа1.ГруппаПрофилей = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВсеСвязи.ИБ КАК ИБ,
	               |	ВсеСвязи.Малыш КАК Малыш
	               |ПОМЕСТИТЬ КУдалению
	               |ИЗ
	               |	ВсеСвязи КАК ВсеСвязи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СвязиГрупп КАК СвязиГрупп
	               |		ПО ВсеСвязи.Папа = СвязиГрупп.Папа
	               |			И ВсеСвязи.Малыш = СвязиГрупп.Малыш
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИБГруппа.ИБ КАК ИБ,
	               |	ИБГруппа.ГруппаПрофилей КАК ГруппаПрофилей
	               |ИЗ
	               |	ИБГруппа КАК ИБГруппа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КУдалению КАК КУдалению
	               |		ПО ИБГруппа.ИБ = КУдалению.ИБ
	               |			И ИБГруппа.ГруппаПрофилей = КУдалению.Малыш
	               |ГДЕ
	               |	КУдалению.ИБ ЕСТЬ NULL
	               |ИТОГИ ПО
	               |	ИБ";    
	Запрос.УстановитьПараметр("ИБ", ИБ);
	Запрос.УстановитьПараметр("Профили",МассивПрофилей);
	
	Ответ = Новый Соответствие;
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл 
		ВыборкаПрофили = Результат.Выбрать();
		Массив = Новый Массив;
		Пока ВыборкаПрофили.Следующий() Цикл 
			Массив.Добавить(ВыборкаПрофили.ГруппаПрофилей);
		КонецЦикла;
		Ответ.Вставить(Результат.ИБ, Массив);
	КонецЦикла;
	
	Возврат Ответ;
КонецФункции

#КонецОбласти
